In [1]:
import pandas as pd
import numpy as np

# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
my_list = [4,8,15,16,23,42]

In [6]:
s1 = pd.Series(my_list)
print(s1)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [7]:
type(s1)

pandas.core.series.Series

# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [10]:
s2 =pd.Series(list(range(0,10)))

In [11]:
print(s2)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [12]:
type(s2)

pandas.core.series.Series

# Q3. Create a Pandas DataFrame that contains the following data:

In [13]:
df = pd.DataFrame({
    'Name'  : ['Alice','Bob','Claire'],
    'Age' : [25,30,27],
    'Gender' : ['Female','Male','Female']
})

In [14]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In pandas, a DataFrame is a two-dimensional data structure that is designed to store and manipulate tabular data. It is similar to a spreadsheet or a SQL table, where data is organized in rows and columns. Each column in a DataFrame represents a variable or feature, and each row represents an observation or record.

On the other hand, a pandas.Series is a one-dimensional data structure that can hold various data types, such as integers, strings, floating-point numbers, etc. A Series is like a labeled array, where the elements are indexed, and each element corresponds to a single value.

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Canyou give an example of when you might use one of these functions?

In [21]:
import seaborn as sns
df1 = sns.load_dataset('titanic')

In [20]:
df1

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [23]:
# head() - used to get top 5 rows by default 
df1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [24]:
#tail() - used to get bottom 5 rows by default
df1.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [25]:
#describe(): This function provides summary statistics of numerical columns in the DataFrame, such as mean, standard deviation, minimum, maximum, quartiles, etc.
df1.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

loc[] and iloc[]: These functions are used for label-based indexing (loc[]) and integer-based indexing (iloc[]). They allow you to access specific rows and columns in the DataFrame.

In [26]:
df1.loc[0]

survived                 0
pclass                   3
sex                   male
age                   22.0
sibsp                    1
parch                    0
fare                  7.25
embarked                 S
class                Third
who                    man
adult_male            True
deck                   NaN
embark_town    Southampton
alive                   no
alone                False
Name: 0, dtype: object

In [27]:
df1.iloc[5]

survived                0
pclass                  3
sex                  male
age                   NaN
sibsp                   0
parch                   0
fare               8.4583
embarked                Q
class               Third
who                   man
adult_male           True
deck                  NaN
embark_town    Queenstown
alive                  no
alone                True
Name: 5, dtype: object

In [38]:
#groupby() - can be used to group by a specific value
df1.groupby('sex').mean()['age']

sex
female    27.915709
male      30.726645
Name: age, dtype: float64

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series and DataFrame are mutable in pandas, while Panel is not a relevant data structure to consider as it has been deprecated.

# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [39]:



name_series = pd.Series(['Alice', 'Bob', 'Charlie', 'David'])
age_series = pd.Series([25, 30, 35, 28])
city_series = pd.Series(['New York', 'London', 'Paris', 'Sydney'])


data = {
    'Name': name_series,
    'Age': age_series,
    'City': city_series
}

df = pd.DataFrame(data)


print(df)

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris
3    David   28    Sydney